import { useState } from "react";
import { FaChevronLeft } from "react-icons/fa";
function UpperOfDownSection() {
  const appStores = [
    {
      src: "https://www.digikala.com/statics/img/svg/appStores/coffe-bazzar.svg",
      alt: "دریافت از کافه‌بازار",
    },
    {
      src: "https://www.digikala.com/statics/img/svg/appStores/myket.svg",
      alt: "دریافت از مایکت",
    },
    {
      src: "https://www.digikala.com/statics/img/svg/appStores/sib-app.svg",
      alt: "دریافت از سیب‌اپ",
    },
  ];
  const trustBadges = [
    {
      src: "https://www.digikala.com/statics/img/png/rezi.webp",
      alt: "نشان ملی ثبت",
    },
    {
      src: "https://www.digikala.com/statics/img/png/kasbokar.webp",
      alt: "نماد کسب و کار های مجازی",
    },
    {
      src: "https://Trustseal.eNamad.ir/logo.aspx?id=19077&Code=sScdOJOzhFxtcEqkjP7P",
      alt: "نماد اعتماد الکترونیک",
    },
  ];
  const [isOpen, setIsOpen] = useState(false);
  const toggleAccordion = () => {
    setIsOpen(!isOpen);
  };
  return (
    <>
      <div className="flex flex-row mb-7 px-5 rounded bg-[#3C4B6D] py-2 items-center justify-between h-[76px]">
        <div className="flex items-center text-white mb-0">
          <div className="w-11 h-11 leading-none">
            <img
              className="w-full inline-block object-cover h-full"
              src="https://www.digikala.com/statics/img/png/footerlogo2.webp"
              alt="دیجی‌کالا"
            />
          </div>
          <div className="text-xl mr-4">دانلود اپلیکیشن دیجی‌کالا</div>
        </div>
        <div className="flex items-center justify-end">
          <div className="flex items-center justify-end flex-wrap">
            {appStores.map((app, index) => (
              <a key={index} className="m-2">
                <div className="h-11 rounded leading-none">
                  <img
                    className="w-full h-full inline-block object-contain rounded"
                    src={app.src}
                    alt={app.alt}
                  />
                </div>
              </a>
            ))}
          </div>
          <a className="mr-4">
            <div className="w-11 h-11 rounded leading-none  bg-white">
              <img
                className="w-full h-full inline-block object-cover rounded"
                src="https://www.digikala.com/statics/img/svg/More.svg"
              />
            </div>
          </a>
        </div>
      </div>
      <div className="flex items-start justify-between border-y-[0.5px] border-[#e0e0e2] py-8 flex-nowrap">
        <div className="grow">
          <div className="ml-10 text-neutral-500 overflow-hidden text-[13px]">
            <h1 className="text-[20px] text-[#62666d] mb-2">
              فروشگاه اینترنتی دیجی‌کالا، بررسی، انتخاب و خرید آنلاین
            </h1>

            <div
              className={`relative  leading-loose ${
                !isOpen ? "line-clamp-3" : ""
              }`}
            >
              <p>
                یک
                <strong> خرید</strong> اینترنتی مطمئن، نیازمند فروشگاهی است که
                بتواند کالاهایی متنوع، باکیفیت و دارای قیمت مناسب را در مدت زمان
                ی کوتاه به دست مشتریان خود برساند و ضمانت بازگشت کالا هم داشته
                باشد؛ ویژگی‌هایی که فروشگاه اینترنتی دیجی‌کالا سال‌هاست بر روی
                آن‌ها کار کرده و توانسته از این طریق مشتریان ثابت خود را داشته
                باشد.
                <br />
                یکی از مهم‌ترین دغدغه‌های کاربران دیجی‌کالا یا هر فروشگاه‌
                اینترنتی دیگری، این است که کالای خریداری شده چه زمانی به دستشان
                می‌رسد. دیجی‌کالا شیوه‌های مختلفی از ارسال را متناسب با فروشنده
                کالا،‌ مقصد کالا و همچنین نوع کالا در اختیار کاربران خود قرار
                می‌دهد. هر یک&nbsp;از روش های ارسال دیجی کالا شرایط و ویژگی‌های
                خاص خود را دارند که ممکن است گاهی برای کاربران جدید، مبهم و
                پیچیده به نظر برسند. برای آگاهی بیشتر مشتریان از خدمات
                دیجی‌کالا، این فروشگاه اینترنتی در بخشی از وب‌سایت خود راهنمای
                کاملی از شیوه‌‌های ارسال را به صورت ساده و به دور از پیچیدگی،
                قرار داده است که شامل 8 نوع ارسال کالا به روش‌های زیر است: ارسال
                امروز، دریافت حضوری، دریافت از گنجه، ارسال توسط فروشنده، ارسال
                عادی، ارسال کالاهای بزرگ، سنگین و فوق سنگین، ارسال سریع
                سوپرمارکتی، ارسال با پست
              </p>
              <p>کدام محصولات در دیجی‌کالا قابل سفارش هستند؟</p>
              <p>
                تقریبا می‌توان گفت محصولی وجود ندارد که دیجی‌کالا برای مشتریان
                خود در سراسر کشور فراهم نکرده باشد. شما می‌توانید در تمامی
                روزهای هفته و تمامی شبانه روز&nbsp;دیجی‌کالا که محصولات دارای
                تخفیف عالی می‌شوند، سفارش خود را به سادگی ثبت کرده و در روز و
                محدوده زمانی مناسب خود، درب منزل تحویل بگیرید. بعضی از گروه‌های
                اصلی و زیر مجموعه‌های پرطرفدار محصولات دیجی‌کالا شامل مواردی
                می‌شود که در ادامه به معرفی آن‌ها می‌پردازیم که&nbsp;امکان{" "}
                <strong>ارسال امروز</strong> برای آن ها وجود دارد.&nbsp;
              </p>
              <p>
                دیجی کالا در جشنواره‌های سالیانه خود به طور معمول روی تمام دسته
                بندی‌های کالایی تخفیف‌های عالی قرار‌می‌دهد. به عنوان مثال در
                زمان
                <span className="text-[#19bfd3]"> بلک فرایدی </span>
                یا حراج جمعه سیاه، در این سال‌ها بیشترین درصد تخفیف در اختیار
                مشتریان دیجی‌کالا قرار گرفته‌است و شامل دسته بندی های مختلف از
                موبایل و لپ تاپ تا عطر و لباس و حتی غذای حیوانات خانگی
                بوده‌است.&nbsp;
              </p>
              <p>کالای دیجیتال</p>
              <p>
                انواع گوشی موبایل از برندهای مختلفی مثل آیفون،&nbsp;
                <span className="text-[#19bfd3]">گوشی سامسونگ</span>،
                <span className="text-[#19bfd3]">گوشی نوکیا</span>،
                <span className="text-[#19bfd3]">گوشی شیائومی</span>،
                <span className="text-[#19bfd3]"> گوشی هواوی</span> ، و...،
                انواع کنسول بازی ps4 و ps5، انواع تبلت‌های پرطرفدار مثل&nbsp;
                <span className="text-[#19bfd3]">تبلت سامسونگ</span>
                &nbsp;نوت 10، انواع هندزفری مثل&nbsp;
                <span className="text-[#19bfd3]">هندزفری بی سیم </span>
                ،&nbsp;
                <span className="text-[#19bfd3]">تلوزیون</span>
                &nbsp;از برندهای مختلف مثل تلویزیون سامسونگ، سونی و...، انواع
                مانیتور، کیس، کیبورد، مودم از برندهای مختلف مثل&nbsp;مودم
                ایرانسل،&nbsp;آنتن&nbsp;و ... تنها بخشی از محصولاتی هستند که زیر
                مجموعه کالای دیجیتال در دیجی‌کالا قرار دارند.
              </p>
              <p>خودرو، ابزار و تجهیزات صنعتی</p>
              <p>
                انواع خودروهای ایرانی و خارجی از برندهای مطرحی مثل هوندا، کیا
                و...، موتور سیکلت از برندهایی مثل کویر موتور و...، لوازم جانبی
                خودرو مثل سیستم صوتی تصویر، ضبط و...، لوازم یدکی مثل دیسک و صفحه
                کلاج و... و لوازم مصرفی خودرو مثل&nbsp;کفپوش سانا&nbsp;در این
                گروه قرار می‌گیرند.
              </p>
              <p>مد و پوشاک</p>
              <p>
                محصولاتی مثل انواع لباس مثل لباس مجلسی زنانه و مردانه، لباس
                راحتی، لباس ورزشی، اکسسوری، کیف، کفش، عینک آفتابی، لباس زیر، شال
                و روسری و... جزو مواردی هستند که می‌توانید آن‌ها را از برندهای
                مطرح ایرانی و خارجی موجود در دیجی کالا مثل آدیداس، نایکی،
                دبنهامز، آلدو، درسا و... خریداری کنید.
              </p>
              <p>اسباب بازی کودک و نوزاد</p>
              <p>
                در این دسته از کالاهای دیجی‌کالا، انواع لوازم بهداشتی و حمام
                کودک و نوزاد، انواع پوشاک و کفش،{" "}
                <span className="text-[#19bfd3]">تبلت </span> ,{" "}
                <span className="text-[#19bfd3]">اسباب‌بازی</span> ،لوازم اتاق
                خواب کودک، لوازم ایمنی، لوازم شخصی و غذا خوری و ... قرار می‌گیرد
                تا خرید را برای پدر و مادرها به کاری سریع و آسان تبدیل کند.
              </p>
              <p>کالاهای سوپر مارکتی</p>
              <p>
                هر چیزی از مواد خوراکی که به آن نیاز دارید، در{" "}
                <span className="text-[#19bfd3]">سوپرمارکت</span> دیجی‌کالا پیدا
                می‌شود، محصولات پرطرفداری مثل&nbsp;کره
                بادام‌زمینی،&nbsp;عسل،&nbsp;سس،&nbsp;قهوه،&nbsp;زعفران، شکلات،
                انواع نان و ... از برندهای معتبر و معروفی مثل&nbsp;نستله، نوتلا،
                استارباکس، مزمز، چی توز و ... همگی در اختیار شما هستند و تا
                رسیدن به آشپزخانه شما تنها چند کلیک فاصله دارند.
              </p>
              <h2>زیبایی و سلامت</h2>
              <p>
                انواع لوازم آرایش مثل لاک، رنگ مو، لوازم آرایش لب، چشم، صورت
                و... همگی در دیجی‌کالا موجود هستند. همچنین محصولات بهداشتی مثل
                انواع شامپو،{" "}
                <span className="text-[#19bfd3]">کرم ضد آفتاب</span> ماسک صورت،
                ضد تعریق،&nbsp;ماسک مو&nbsp; و...، انواع لوازم شخصی برقی، ست
                هدیه، بهترین انواع عطر و اسپری،{" "}
                <span className="text-[#19bfd3]">کرم پودر</span>، ریمل و رژلب
                وانواع زیورآلات طلا و نقره مثل&nbsp;سرویس طلا، سرویس نقره و...
                به همراه وسایل مراقبت شخصی طبی در گروه زیبایی و سلامت دیجی‌کالا
                قرار می‌گیرد. در این بخش برندهای مطرحی مثل اسنس، پنبه ریز، سینره
                و... حضور دارند.همچنین میتوانید انواع مکمل غذایی و دارویی مثل{" "}
                <span className="text-[#19bfd3]">سرماخوردگی</span> را در دیجی
                کالا تهیه کنید.
              </p>
              <p>خانه و آشپزخانه</p>
              <p>
                یکی از متنوع‌ترین بخش‌های دیجی‌کالا، بخش لوازم خانه و آشپزخانه
                است که از محصولاتی مثل صندلی گیمینگ در بخش صندلی‌ها گرفته تا
                انواع&nbsp;مبل راحتی، انواع آبگرمکن مثل&nbsp;آبگرمکن بوتان،
                لباسشویی‌های متنوع مثل انواع&nbsp;لباسشویی اسنوا، شیرآلات مختلف
                مثل شیرآلات قهرمان و...، ظروف و همچنین لوازم برقی آشپزخانه مثل
                توستر و... را شامل می‌شود و امکان خریدی عالی را برای مشتریان
                فراهم کرده است. در بخش لوازم خانگی دیجی‌کالا، برندهای معتبری مثل
                تفال، اخوان، فیلیپس، ال جی، اسنوا، جی پلاس و... حضور دارند.
              </p>
              <p>کتاب، لوازم تحریر و هنر</p>
              <p>
                بخش هنر، کتاب، رمان و لوازم تحریر دیجی‌کالا نیز یکی از
                متنوع‌ترین بخش‌های این فروشگاه اینترنتی است. انواع کتاب و مجله،
                کتاب زبان، بازی، لوازم تحریر با طرح‌های مختلف مانند دختر
                کفشدوزکی، سازهایی مثل&nbsp;پیانو،&nbsp;سنتور،&nbsp;هنگ
                درام&nbsp; و... با بهترین قیمت‌ها و از بهترین برندها در دسترس
                شما قرار دارند.
              </p>
              <p>ورزش و سفر</p>
              <p>
                هر نوع وسیله و لباس ورزشی که فکرش را کنید، انواع وسایل کمپینگ و
                کوهنوردی، ساک و قمقمه ورزشی و وسایل سفر اربعین و... در این بخش
                قرار می‌گیرند. همچنین شما می‌توانید وسایل مد نظر خود را بر اساس
                نوع ورزش (آبی، هوازی، بدنسازی و...) در دسته‌بندی‌های دیجی‌کالا
                پیدا کنید.
              </p>
              <p>محصولات بومی و محلی</p>
              <p>
                و در آخر دیجی‌کالا از طریق به فروش رساندن محصولات بومی و سنتی
                متفاوتی مثل انواع خوراکی، گلیم و گبه، ابزار و ... تلاش کرده تا
                بین هنر ایرانی و متقاضیان آن کوتاه‌ترین راه را پیدا کند. در این
                بخش شما می‌توانید انواع محصولات از جمله ظروف زیبای مخصوص
                به&nbsp;سفره هفت‌سین&nbsp; و پذیرایی از مهمانان در
                روزهای&nbsp;نوروز، انواع آیینه و شمعدان و هر آن چیزی را که برای
                خلق زیبایی در روزهای بهاری به آن نیاز دارید، با قیمت مناسب و
                تنوع بسیار بالا انتخاب کنید. همچنین در صفحه{" "}
                <strong>برچسب ها</strong>، امکان مشاهده و خرید انواع محصولات با
                طرح های بومی وجود دارد.&nbsp;&nbsp;دیجی‌کالا همچنین برای اینکه
                حال و هوای عید را به اعضای خود هدیه کند،&nbsp;تقویم ۱۴۰۱، انواع
                ایده&nbsp;عکس پروفایل عید نوروز،&nbsp;آهنگ‌های عید نوروز&nbsp;و
                موزیک‌های شاد بهاری، وسایل مربوط به&nbsp;خانه‌تکانیی
                و&nbsp;انواع لباس های عید&nbsp; را برای شما فراهم کرده است تا
                بتوانید در کنار خرید خود، از این حال و هوای تازه نهایت لذت را
                ببرید.
              </p>
              <p>&nbsp;</p>
              {!isOpen && (
                <div className="absolute inset-0 bg-gradient-to-b from-transparent to-white opacity-[0.7] pointer-events-none h-auto" />
              )}
            </div>
          </div>
          <span className="cursor-pointer flex mt-3 items-center">
            <span
              onClick={toggleAccordion}
              className="flex items-center h-full ml-1 text-[13px] text-[#19bfd3]"
            >
              {!isOpen ? "مشاهده بیشتر" : "بستن"}
            </span>
            <div className="flex items-center h-full">
              <FaChevronLeft className="mt-[3px] text-[#19bfd3] w-[6px]" />
            </div>
          </span>
        </div>
        <div className="w-full flex items-center mt-4 lg:mt-0 justify-end">
          {trustBadges.map((badge, index) => (
            <div
              key={index}
              className="cursor-pointer p-2 lg:p-4 flex items-center justify-center border border-gray-200 rounded mr-2"
            >
              <div className="w-[75px] h-[75px]">
                <img
                  className="w-full h-full object-contain"
                  src={badge.src}
                  alt={badge.alt}
                />
              </div>
            </div>
          ))}
        </div>
      </div>
    </>
  );
}
export default UpperOfDownSection;
